w6d4/AjaxDemo/app/controllers/friendships_controller.rb

  def create
    sleep(2)
    @friendship = Friendship.create!(params[:friendship])
    @users = User.all
---
INSERT INTO "friendships" ("created_at", "friend_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 23 Aug 2013 22:31:48 UTC +00:00], ["friend_id", 2], ["updated_at", Fri, 23 Aug 2013 22:31:48 UTC +00:00], ["user_id", 1]]
SELECT "users".* FROM "users"

  def destroy
    sleep(2)
    @friendship = Friendship.where(params[:friendship])[0]
    @friendship.delete
    @users = User.all
---
DELETE FROM "friendships" WHERE "friendships"."id" = 3
SELECT "users".* FROM "users"