w6d4/AjaxDemo/app/controllers/secrets_controller.rb

INSERT INTO "secrets" ("author_id", "created_at", "recipient_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["created_at", Fri, 23 Aug 2013 20:50:34 UTC +00:00], ["recipient_id", 2], ["title", "Hi"], ["updated_at", Fri, 23 Aug 2013 20:50:34 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def create
    @secret = Secret.create!(params[:secret])
    @user = User.find(params[:user_id])