w6d4/AjaxDemo/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 1
---
  def index
    @users = User.all
    @friendships = Friendship.where(user_id: current_user.id)

INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    if @user.save